//#define _CRT_SECURE_NO_WARNINGS
//
//#include <stdio.h>
//
////有三种
////1 & 按（二进制）位与
////2 | 按（二进制）位或
////3 ^ 按（二进制）位异或
//
////位操作符的操作数只能是整数
//int main()
//{
//	//1 & 按位与
//	int a1 = 4;
//	int a2 = 10;
//	int a3 = a1 & a2;
//	//使用&操作符时，将会对其两个操作数a1,a2的补码的每一位进行比对，当两者某一位的补码都是1，才会留下1，只要有一者为0，那就留下0；
//	//a2的原码；10000000000000000000000000001010
//	//a2的反码；11111111111111111111111111110101
//	//a2的补码；11111111111111111111111111110110
//	//a1的补码：00000000000000000000000000000100
//	//二者对比；00000000000000000000000000000100（这就是对比出来的补码，符号位是0代表这是正数，所以补码也是原码，转换为十进制即4）
//
//	printf("%d\n", a3);
//
//	//2 | 按位或
//	int b1 = 4;
//	int b2 = -10;
//	int b3 = b1 | b2;
//	//使用|操作符时，将会对其两个操作数b1,b2的补码的每一位进行比对，当两者某一位的补码都是0，才会留下0，只要有一者为1，那就留下1
//	//a2的原码；10000000000000000000000000001010
//	//a2的反码；11111111111111111111111111110101
//	//a2的补码；11111111111111111111111111110110
//	//a1的补码：00000000000000000000000000000100
//	//二者对比；11111111111111111111111111110110（这就是对比出来的补码，符号位是1代表这是负数，所以还需换算成原码才知道其对应的十进制）
//	//反码结果；11111111111111111111111111110101
//	//原码结果；10000000000000000000000000001010（十进制为-10）
//
//	printf("%d\n", b3);
//
//	//3 ^ 按位或
//	int c1 = 3;
//	int c2 = 5;
//	int c3 = c1 ^ c2;
//	//使用|操作符时，将会对其两个操作数c1,c2的补码的每一位进行比对，当两者某一位相同，留下0，相异，留下1
//	//a2的原码；10000000000000000000000000001010
//	//a2的反码；11111111111111111111111111110101
//	//a2的补码；11111111111111111111111111110110
//	//a1的补码：00000000000000000000000000000100
//	//二者对比；11111111111111111111111111110010（这就是对比出来的补码，符号位是1代表这是负数，所以还需换算成原码才知道其对应的十进制）
//	//反码结果；11111111111111111111111111110001
//	//原码结果；10000000000000000000000000001110（十进制为-14）
//
//	printf("%d\n", c3);
//
//	//结论；
//	//2 0 ^ 整数，得该整数
//	//3 相同数异或，得0
//
//	//练习
//	//交换两个数，不可以创建新的变量
//	int x = -3;
//	int y = 5;
//	x = x ^ y;
//	y = x ^ y;//等于3 ^ 5 ^ 5 ---> 3
//	x = x ^ y;//等于3 ^ 5 ^ 3 ---> 5
//
//	printf("%d %d\n", x, y);
//	return 0;
//}