//#define _CRT_SECURE_NO_WARNINGS
//
//#include <stdio.h>
//
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	//a是前置++，所以在表达式里a的值还是0，但是外面的a就是1了
//	//由于逻辑与&&必须所有表达式都为真才会进行，一旦遇到0，为假就不会再继续运行并且返回0，所有表达式a++之后其他的表达式都没有运行，所以值也不会变
//	printf("a=%d\nb=%d\nc=%d\nd=%d\n", a , b, c, d);
//	//得到1 2 3 4
//
//	int j = 0, a2 = 1, b2 = 2, c2 = 3, d2 = 4;
//	j = a2++ || ++b2 || d2++;
//	//a2是1，为真，由于逻辑或只要有一者为真，就算真，并返回1，所以之后的表达式就不需要运行了
//	printf("a2=%d\nb2=%d\nc2=%d\nd2=%d\n", a2, b2, c2, d2);
//	//得到2 2 3 4
//	return 0;
//}